kre.org
#+title: Knowledge Representation and Engineering
#+AUTHOR:
#+LATEX_CLASS_OPTIONS: [a4paper,10pt]
* Info
   :PROPERTIES:
   :ID:       KRE
   :University: URV
   :ECTS:     6
   :Timetable: 15-18h, Wednesday
   :URL: https://campusvirtual.urv.cat/course/view.php?id=88255
   :Email:    david.riano@urv.cat
   :Final_exam_date: 15/06/2021
   :END:
* IN-PROGRESS Introduction and Concepts
** Introduction

 We introduce two different areas dealing with "knowledge"

 - Knowledge Representation :: Artificial Intelligence area concerned with how to represent and manipulate knowledge in an automated way.

 - Knowledge Engineering :: Computer Engineering area concerned with procedures and methods helping developers to systematically and formally construct knowledge bases.

 A generic knowledge-based system deals with an input $I$ and an output $O=f(I,K)$
 - e.g. $I=\text{Symptoms}, K=\text{Medical knowledge}, O=\text{Drug}$
 - The knowledge is provided by a *knowledgebase*
 - The system behaves in an *intelligent* way

 But why should we use a knowledgebase instead of a database? Consider a database having the following tables:
 - ~PERSONS~ table
 | Id  | Name   |
 |-----+--------|
 | A   | Albert |
 | B   | Beth   |
 | C   | Cindy  |
 | ... | ...    |
 - ~PARENTSHIPS~ table
 | X   | Y   |
 |-----+-----|
 | A   | B   |
 | B   | C   |
 | B   | D   |
 | ... | ... |

 We can ask the following questions
 - Is ~A~ a parent of ~B~?
   - ~SELECT X FROM PARENTSHIPS WHERE X="A",Y="B";~
 - Who are the parents of ~B~?
   - ~SELECT X FROM PARENTSHIPS WHERE Y="B";~
 - Who are the sons of ~A~?
   - ~SELECT X FROM PARENTSHIPS WHERE Y="B";~
 - Who are the ancestors?
   - With a table of ~ANCESTORS~
     - With $n$ people, ~ANCESTORS~ is in $O(n^2)$
     - If $1$ generation has (on average) $2.36$ ancestors, then $20$ generations have $28.7$ million ancestors
   - With some explicit "knowledge" (e.g. intelligence)
     - ~ANCESTOR~
       - If ~X~ is a parent of ~Y~ then ~X~ is an ancestor of ~Y~
       - If ~X~ is an ancestor of ~Z~ and ~Z~ is a parent of ~Y~ then ~X~ is an ancestor of ~Y~
     - We can rely on this knowledge base to answer the question
      #+begin_src
      if PARENT(X,Y) then return true;
      else
       search Z: PARENT(Z,Y)
       if Z does not exist then return false;
       else
	return Ancestor(X,Z.father) or Ancestor(X,Z.mother);
      #+end_src

 *Decision Support Systems* are computer systems helping users to make decisions in complex domains.

** Data, Information, and Knowledge

- Data :: Raw and without context, it simply exists in its form (either usable or not)
- Information :: Data + Meaning, it can change the perception of the receiver about something
- Meaning :: For Davenport and Prusak, the five C's describe what gives meaning
  - Contextualization :: Purpose of data
  - Categorization :: Classified or generalization to concepts
  - Calculation :: Mathematical or statistical analysis
  - Correction :: Removal of erros
  - Condensation :: Removal of unnecessary elements
- Knowledge :: Information + "something", generalized to increase applicability. What is "something"?
  - For Davenport and Prusak, the four C's describe it asyes

    - Comparison :: Similarity to other contexts
    - Consequence :: Implication in decision taking
    - Connection :: Relationship with other information
    - Conversation :: Feedback of people
  - For Tobin, "something" is an ayes
pplication

- Wisdom :: Knowledge + Intuition + Experience
- Expertise :: Wisdom + Selection + Principles + Constrains + Learning
- Capability :: Expertise + Integration + Distribution + Navigation

** TODO Types and Uses of Knowledge
** TODO Knowledge Representation
** TODO Knowledge Engineering
** TODO Syntax ans Semantics
** TODO Conclusions
* TODO Knowledge Representation
** TODO First Order Logic
** Rules and Production Systems
** Object Oriented Representation
** Network Representation
** Ontologies
* TODO Knowledge Engineering
** Knowledge Life Cycle
** Knowledge Auditing
** Knowledge Deployment
** Knowledge Acquisition
* TODO Knowledge Representation in the Web
