kre.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-26 vie 11:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Knowledge Representation and Engineering</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="eros" />
</head>
<body>
<div id="content">
<h1 class="title">Knowledge Representation and Engineering</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaa011f0">1. Info</a></li>
<li><a href="#orgd7dd102">2. <span class="todo IN_PROGRESS">IN-PROGRESS</span> Introduction and Concepts</a>
<ul>
<li><a href="#orgbc96b36">2.1. <span class="done DONE">DONE</span> Introduction</a></li>
<li><a href="#orgf6e317f">2.2. <span class="done DONE">DONE</span> Data, Information, and Knowledge</a></li>
<li><a href="#org75f4edd">2.3. <span class="todo TODO">TODO</span> Types and Uses of Knowledge</a></li>
<li><a href="#orgbdf3210">2.4. <span class="todo TODO">TODO</span> Knowledge Representation</a></li>
<li><a href="#orga925531">2.5. <span class="todo TODO">TODO</span> Knowledge Engineering</a></li>
<li><a href="#orgc4dd2dd">2.6. <span class="todo TODO">TODO</span> Syntax ans Semantics</a></li>
<li><a href="#orga45bfdc">2.7. Conclusions</a></li>
<li><a href="#org7638810">2.8. Exercises</a></li>
</ul>
</li>
<li><a href="#org5e34f54">3. Knowledge Representation</a>
<ul>
<li><a href="#orgdb0eee5">3.1. <span class="todo TODO">TODO</span> First Order Logic</a></li>
<li><a href="#orgf04a2e8">3.2. Rules and Production Systems</a></li>
<li><a href="#org6233efb">3.3. Object Oriented Representation</a></li>
<li><a href="#org743009a">3.4. Network Representation</a></li>
<li><a href="#orgeae80ed">3.5. Ontologies</a></li>
</ul>
</li>
<li><a href="#orge4ec09e">4. Knowledge Engineering</a>
<ul>
<li><a href="#org534356b">4.1. Knowledge Life Cycle</a></li>
<li><a href="#org9bed0f8">4.2. Knowledge Auditing</a></li>
<li><a href="#org48e9cee">4.3. Knowledge Deployment</a></li>
<li><a href="#org9f20f08">4.4. Knowledge Acquisition</a></li>
</ul>
</li>
<li><a href="#org95c2d2a">5. Knowledge Representation in the Web</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgaa011f0" class="outline-2">
<h2 id="orgaa011f0"><span class="section-number-2">1</span> Info</h2>
<div class="outline-text-2" id="text-1">
</div>
</div>
<div id="outline-container-orgd7dd102" class="outline-2">
<h2 id="orgd7dd102"><span class="section-number-2">2</span> <span class="todo IN_PROGRESS">IN-PROGRESS</span> Introduction and Concepts</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgbc96b36" class="outline-3">
<h3 id="orgbc96b36"><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> Introduction</h3>
<div class="outline-text-3" id="text-2-1">
<p>
We introduce two different areas dealing with &ldquo;knowledge&rdquo;
</p>

<dl class="org-dl">
<dt>Knowledge Representation</dt><dd>Artificial Intelligence area concerned with how to represent and manipulate knowledge in an automated way.</dd>

<dt>Knowledge Engineering</dt><dd>Computer Engineering area concerned with procedures and methods helping developers to systematically and formally construct knowledge bases.</dd>
</dl>

<p>
A generic knowledge-based system deals with an input \(I\) and an output \(O=f(I,K)\)
</p>
<ul class="org-ul">
<li>e.g. \(I=\text{Symptoms}, K=\text{Medical knowledge}, O=\text{Drug}\)</li>
<li>The knowledge is provided by a <b>knowledgebase</b></li>
<li>The system behaves in an <b>intelligent</b> way</li>
</ul>

<p>
But why should we use a knowledgebase instead of a database? Consider a database having the following tables:
</p>
<ul class="org-ul">
<li><code>PERSONS</code> table</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Id</th>
<th scope="col" class="org-left">Name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-left">Albert</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">Beth</td>
</tr>

<tr>
<td class="org-left">C</td>
<td class="org-left">Cindy</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li><code>PARENTSHIPS</code> table</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">X</th>
<th scope="col" class="org-left">Y</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-left">B</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">C</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">D</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
</table>

<p>
We can ask the following questions
</p>
<ul class="org-ul">
<li>Is <code>A</code> a parent of <code>B</code>?
<ul class="org-ul">
<li><code>SELECT X FROM PARENTSHIPS WHERE X="A",Y="B";</code></li>
</ul></li>
<li>Who are the parents of <code>B</code>?
<ul class="org-ul">
<li><code>SELECT X FROM PARENTSHIPS WHERE Y="B";</code></li>
</ul></li>
<li>Who are the sons of <code>A</code>?
<ul class="org-ul">
<li><code>SELECT X FROM PARENTSHIPS WHERE Y="B";</code></li>
</ul></li>
<li>Who are the ancestors?
<ul class="org-ul">
<li>With a table of <code>ANCESTORS</code>
<ul class="org-ul">
<li>With \(n\) people, <code>ANCESTORS</code> is in \(O(n^2)\)</li>
<li>If \(1\) generation has (on average) \(2.36\) ancestors, then \(20\) generations have \(28.7\) million ancestors</li>
</ul></li>
<li>With some explicit &ldquo;knowledge&rdquo; (e.g. intelligence)
<ul class="org-ul">
<li><code>ANCESTOR</code>
<ul class="org-ul">
<li>If <code>X</code> is a parent of <code>Y</code> then <code>X</code> is an ancestor of <code>Y</code></li>
<li>If <code>X</code> is an ancestor of <code>Z</code> and <code>Z</code> is a parent of <code>Y</code> then <code>X</code> is an ancestor of <code>Y</code></li>
</ul></li>
<li><p>
We can rely on this knowledge base to answer the question
</p>
<pre class="example">
if PARENT(X,Y) then return true;
else
 search Z: PARENT(Z,Y)
 if Z does not exist then return false;
 else
  return Ancestor(X,Z.father) or Ancestor(X,Z.mother);
</pre></li>
</ul></li>
</ul></li>

<li id="Decision Support Systems">Computer systems helping users to make decisions in complex domains</li>
</ul>
</div>
</div>

<div id="outline-container-orgf6e317f" class="outline-3">
<h3 id="orgf6e317f"><span class="section-number-3">2.2</span> <span class="done DONE">DONE</span> Data, Information, and Knowledge</h3>
<div class="outline-text-3" id="text-2-2">
<dl class="org-dl">
<dt>Data</dt><dd>Raw and without context, it simply exists in its form (either usable or not)</dd>
<dt>Information</dt><dd>Data + Meaning, it can change the perception of the receiver about something
<dl class="org-dl">
<dt>Meanings</dt><dd>The five C&rsquo;s of Davenport&amp;Prusak describe what can give meaning to data
<dl class="org-dl">
<dt>Contextualization</dt><dd>Purpose of data</dd>
<dt>Categorization</dt><dd>Classified or generalization to concepts</dd>
<dt>Calculation</dt><dd>Mathematical or statistical analysis</dd>
<dt>Correction</dt><dd>Removal of erros</dd>
<dt>Condensation</dt><dd>Removal of unnecessary elements</dd>
</dl></dd>
</dl></dd>
<dt>Knowledge</dt><dd>Information + &ldquo;something&rdquo;, generalized to increase applicability. What is &ldquo;something&rdquo;?
<ul class="org-ul">
<li>The four C&rsquo;s of Davenport&amp;Prusak describe what &ldquo;something&rdquo; can be
<dl class="org-dl">
<dt>Comparison</dt><dd>Similarity to other contexts</dd>
<dt>Consequence</dt><dd>Implication in decision taking</dd>
<dt>Connection</dt><dd>Relationship with other information</dd>
<dt>Conversation</dt><dd>Feedback of people</dd>
</dl></li>
<li id="Tobin">&ldquo;Something&rdquo; = Application</li>
</ul></dd>

<dt>Wisdom</dt><dd>Knowledge + Intuition + Experience</dd>
<dt>Expertise</dt><dd>Wisdom + Selection + Principles + Constrains + Learning</dd>
<dt>Capability</dt><dd>Expertise + Integration + Distribution + Navigation</dd>
</dl>
</div>
</div>

<div id="outline-container-org75f4edd" class="outline-3">
<h3 id="org75f4edd"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> Types and Uses of Knowledge</h3>
</div>
<div id="outline-container-orgbdf3210" class="outline-3">
<h3 id="orgbdf3210"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> Knowledge Representation</h3>
</div>
<div id="outline-container-orga925531" class="outline-3">
<h3 id="orga925531"><span class="section-number-3">2.5</span> <span class="todo TODO">TODO</span> Knowledge Engineering</h3>
</div>
<div id="outline-container-orgc4dd2dd" class="outline-3">
<h3 id="orgc4dd2dd"><span class="section-number-3">2.6</span> <span class="todo TODO">TODO</span> Syntax ans Semantics</h3>
</div>
<div id="outline-container-orga45bfdc" class="outline-3">
<h3 id="orga45bfdc"><span class="section-number-3">2.7</span> Conclusions</h3>
</div>
<div id="outline-container-org7638810" class="outline-3">
<h3 id="org7638810"><span class="section-number-3">2.8</span> <a href="exercises.html#MissingReference">Exercises</a></h3>
</div>
</div>
<div id="outline-container-org5e34f54" class="outline-2">
<h2 id="org5e34f54"><span class="section-number-2">3</span> Knowledge Representation</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgdb0eee5" class="outline-3">
<h3 id="orgdb0eee5"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> First Order Logic</h3>
</div>
<div id="outline-container-orgf04a2e8" class="outline-3">
<h3 id="orgf04a2e8"><span class="section-number-3">3.2</span> Rules and Production Systems</h3>
</div>
<div id="outline-container-org6233efb" class="outline-3">
<h3 id="org6233efb"><span class="section-number-3">3.3</span> Object Oriented Representation</h3>
</div>
<div id="outline-container-org743009a" class="outline-3">
<h3 id="org743009a"><span class="section-number-3">3.4</span> Network Representation</h3>
</div>
<div id="outline-container-orgeae80ed" class="outline-3">
<h3 id="orgeae80ed"><span class="section-number-3">3.5</span> Ontologies</h3>
</div>
</div>
<div id="outline-container-orge4ec09e" class="outline-2">
<h2 id="orge4ec09e"><span class="section-number-2">4</span> Knowledge Engineering</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org534356b" class="outline-3">
<h3 id="org534356b"><span class="section-number-3">4.1</span> Knowledge Life Cycle</h3>
</div>
<div id="outline-container-org9bed0f8" class="outline-3">
<h3 id="org9bed0f8"><span class="section-number-3">4.2</span> Knowledge Auditing</h3>
</div>
<div id="outline-container-org48e9cee" class="outline-3">
<h3 id="org48e9cee"><span class="section-number-3">4.3</span> Knowledge Deployment</h3>
</div>
<div id="outline-container-org9f20f08" class="outline-3">
<h3 id="org9f20f08"><span class="section-number-3">4.4</span> Knowledge Acquisition</h3>
</div>
</div>
<div id="outline-container-org95c2d2a" class="outline-2">
<h2 id="org95c2d2a"><span class="section-number-2">5</span> Knowledge Representation in the Web</h2>
</div>
</div>
</body>
</html>
